Tekla.Structures.Model.SurfaceTreatmentExtensions
The Tekla.Structures.Model.SurfaceTreatmentExtensions class provides a set of static methods for querying objects of type Tekla.Structures.Model.SurfaceTreatment.

Tekla.Structures.Model.SurfaceTreatmentExtensions.ClosestEdgeTo(Tekla.Structures.Model.SurfaceTreatment,Tekla.Common.Geometry.Vector3)
Gets the closest edge of the surfaceTreatment to the given Tekla.Common.Geometry.Vector3 value.
surfaceTreatment: The Tekla.Structures.Model.SurfaceTreatment to get the closest edge from.
point: The Tekla.Structures.Model.SurfaceTreatment to get the closest edge to.
Returns: The closest Tekla.Common.Geometry.Segment3 of the given Tekla.Structures.Model.SurfaceTreatment to the given Tekla.Common.Geometry.Vector3.

Tekla.Structures.Model.SurfaceTreatmentExtensions.GetFace3(Tekla.Structures.Model.SurfaceTreatment)
Gets the Tekla.Structures.Model.SurfaceTreatment as a Tekla.BIM.Geometry.Face3.
surfaceTreatment: The Tekla.Structures.Model.SurfaceTreatment to get the geometrical face for.
Returns: The geometrical face of the given Tekla.Structures.Model.SurfaceTreatment.